import { Hero } from './hero';

export const HEROES:Hero[]=[
	{	
		id:1,
		pic:"../assets/image/wu.png",
		bgpic:"../assets/image/bg-wu.jpg",
		name:"武则天",
		job:"法师",
		winrate:"56.90%",
		attendrate:"1.62%",	
		
		history:"武则天，历史上唯一的女帝，一生极具传奇色彩。 起初她在十四岁时入宫，为唐太宗才人。后来成为高宗的昭仪，并被封为皇后。她积极参与朝政，作为二圣临朝。高宗去世后，武则天先是以太后身份听政，后干脆改唐为周，自立为帝。 作为女帝的武则天重用狄仁杰等贤臣，发展科举，并稳定了西域，使国家开始中兴，为开元之治奠定了基础。但她重用酷吏，翦除宗室，晚年豪奢享乐也遭到后世诟病。",

		bgstory:"大唐帝国至高无上的女帝陛下，永远不会忘记理想国的梦想。 身为天才法师，她在十四岁时就暂露头角。但那破坏性法力引起王室的警惕，将她囚禁在寺院中。无名的老者接近她，向她揭示了未来的命运。老者预知时日无多，想要扶持自己的傀儡。 预言一一应验。先帝爱上武则天将她带入皇宫，她收揽了诸多名将良臣，让崇尚强者的大唐为她倾倒，并在先帝驾崩后登基为女帝。 她不愿再被老者操纵，偷偷与唤灵师订立契约。老者被邀请重回寺院，却踏入陷阱。在唤灵师的帮助下，武则天召唤出曾被老者击败的大魔神王的力量。魔神王理想执念的光辉，最终将老者封禁。 老者遗留的典籍记载着遥远的西方世界，撒旦统治着恶魔手下，策划着吞灭东土的阴谋。女帝露出轻蔑的微笑，为何自己不能反过来抢先吞灭恶魔呢？所有的王者都应该被她踩到脚下，无论他们是人是魔。 “别低头，皇冠会掉。别流泪，女王会笑。”"
	},{
		id:2,
		pic:"../assets/image/gui.png",
		bgpic:"../assets/image/bg-gui.jpg",
		name:"鬼谷子",
		job:"辅助",
		winrate:"53.93%",
		attendrate:"2.30%",	

		history:"鬼谷子，姓王名诩，又名王禅，号玄微子，为春秋战国时期人。因隐居清溪鬼谷，故自称鬼谷先生。他精通百家学问，通天彻地，智慧卓绝，为兵法家尊为圣人，亦是纵横家开山祖师。《史记》中有《苏秦列传》和《张仪列传》记载其事迹，二人均师从鬼谷门下。 鬼谷子的代表作为《鬼谷子》，又名《捭阖策》，一说由鬼谷先生后学者整理其言论而成。该书融合了鬼谷子毕生学术研究精华，总结了纵横家游说经验，为后世了解纵横家与道家思想提供了极有价值的参考，被称为“智慧禁果，旷世奇书”。",

		bgstory:"大河流过平原，滋生了沼泽，森林和古老的信仰。这里是楚汉之地，封闭而僻静，外界的战乱和变迁，似乎总与它无缘。 当太古的文明之光熄灭，一丝余晖残留在了这片大河流域的自然中。名叫鬼谷子的智者，带领弟子和追随者们，忘却了时间和世事的变更，孜孜不倦探求着根源知识的奥秘。他们本奉命为超智慧体建造最后的奇迹，却在封神战争爆发后逃离，躲入森林与河畔的神秘流域。 他们成功了，接近了知识的真相，也接近了长生之术和无穷力量。 但是弟子们合力背叛老师鬼谷子，为首的东皇太一利用铸剑者干将的执着之心，斩断守护的封印夺走了奇迹。 “奇迹”的力量如此强大，使得他们开始无穷止境的进化，远远超越他们的老师。他们最终凭借这力量，成为楚汉之地新的信仰和统治者。他们认为自己是神一样的存在。 他们真是神吗？ 不，并非如此。 他们是伪神。 而且，他们终会陨落。 又经过漫长的时光，邻近的秦国，徐福的势力被一扫而空后，君主嬴政开始他的征伐之道。而转生之术的秘密，意外暴露于名叫刘邦和张良的年轻人眼中。他们还不知道，他们很快就要邂逅宿命的对手和朋友。 森林最深处，那遭到背叛四处飘零的鬼谷子，听到了久违的自然之音。从年轻时代起就苦苦追求的伟大力量，原来并非曾花费半生寻求的知识根源，它的一部分就在这里，就在即将波澜四起的楚汉之地上。"
	},{
		id:3,
		pic:"../assets/image/ying.png",
		bgpic:"../assets/image/bg-ying.jpg",
		name:"嬴政",
		job:"法师",
		winrate:"53.65%",
		attendrate:"7.49%",	

		history:"秦始皇，嬴姓，名政，事迹见于《史记·秦始皇本纪》的记载。他是一位铁腕君主，建立了强大的中央集权国家秦朝，是历史上首个完成华夏大一统的君主。 他13就即位为秦王，由于年少，朝政掌握在吕不韦手中。直到成年后才经过激烈的政治斗争夺回了大权。从亲政开始，他重用李斯、王翦等名臣，积极推动统一大业 ，十年中先后吞并六国，结束了纷乱的战国时代。 灭六国后，为了彰显功业，嬴政自称“皇帝”，继续加强君主的权力。他废除分封制，建立自中央到地方的政治体系；统一文字，货币和度量衡；修筑长城，北击匈奴，南退百越；奠定了中国的疆域，对历史产生了深远的影响。 明代思想家李贽赞誉这位伟大君主为“千古一帝”。",

		bgstory:"嬴政是天生的王者。 人人都臣服他，惧怕他，使他变得高傲自大，肆意无忌。 幼年时，他在太医徐福的密室中发现了浸泡在血池中的孱弱少年。天之骄子的嬴政厌恶这个废柴，嘲笑他，将其视为无聊生活的调剂，以折磨他为乐。 然而，当少年消失时，嬴政初次感到担心和恐惧。几天后，他终于见到已是魔道手术改造体的少年。他微笑着说：“太好了阿政，现在我有能力保护你。这一定是我生来的意义。” 嬴政愤怒的大吼大叫：“朕是生来要统一六国的王者，压根不需要废物的保护。” 话音落地，他陷入深深的无力。真是如此？芈月把持着朝政，他什么都做不了。连阻止少年被改造也无能为力。 之后，嬴政开始秘密建立自己的势力。他发动政变将芈月太后赶下台，真正将秦国掌握。 “朕是天生的君主，手握最强的利剑。朕将统一六国，君临天下！” 不需要虚无的鬼神，不需要牺牲的魔道，统一的腥风血雨即将降临。 “天上天下，唯朕独尊！”"
	},{
		id:4,
		pic:"../assets/image/nv.png",
		bgpic:"../assets/image/bg-nv.jpeg",
		name:"女娲",
		job:"法师",
		winrate:"52.61%",
		attendrate:"7.88%",	

		history:"女娲，中国上古神话中的创世神和始母神，又称娲皇，大地之母等。先于文字记载的原始器皿上早已有关于女娲的描绘，在《山海经》《楚辞》《礼记》等大量文献古籍中亦均有记载关于女娲的创世神话。女娲以身化神，再化生万物，其最广为流传的事迹便是 “抟土造人”、“炼石补天”、“制笙簧”和“置婚姻，合夫妇”等，因此女娲被认为是华夏民族的先祖，福佑社稷的正神。",

		bgstory:"遥远，蔚蓝而美丽的星球啊，我的故乡。那里是终末之地。那里也是起源之地。然而，它已不复存在。我们漂流在大海上，群星聚集为潮水，人人满怀恐惧与彷徨，黑暗如隧道般漫长。即便如此，连一丝悲哀也没有时间去酝酿，唯有紧握方舟之舵，坚信自己正航向的虚无缥缈，却是唯一的希望。所有噩梦都源自“星变”。头顶的星空与脚下的大地支离破碎，恒星一个接一个坍塌，化为无底的黑洞，如风中烛火飘零，随后又一个接一个熄灭。顶尖的精英们聚集起来，想要研究出解决之道。有人提出了惊人的建议，通过星变产生的时空裂隙，借助星际穿梭回到过去，纠正现今的历史。连我也无法相信。直到我们从监测仪中目睹了恒星化为崩塌的黑洞缓缓解体，意识到只剩下这最后的孤注一掷，去挽回无可挽回的未来。方舟。承载了最后的希望。"
	}
]